# 따옴표 사용하기(문자열 자료형)
string1 = 'Some text'
string2 = "큰 따옴표 텍스트"
string3 = '{} 도 {}도 지금 이것도 문자열'.format(string1, string2)

print(string1, string2, string3)

# 작은 따옴표와 큰 따옴표는 서로 바꿔서 사용할 수 있다. (차이가 없음)
# 단, 문자열 안에 작은 따옴표나 큰 따옴표가 포함되어 있는 경우에는 서로 다른 따옴표를 사용해야 한다.
# 작은 따옴표 안에 작은 따옴표를 쓰거나 큰 따옴표 안에 큰 따옴표를 쓰게되면 오류가 발생한다.
quote = '문법검사기 왈 "직접 인용은 큰 따옴표다"'
emphasize = "'문법검사기'를 인용하다니"
# error = "엄마친구아들이 "파이썬이 좋아"라고 했다."

# 여러줄을 입력할때는 따옴표 3개를 사용한다. (줄바꿈 가능)
long_string = '''첫째줄을 쓰고 다음줄에
둘째줄을 써보자'''

print(long_string)

quote1 = "가끔은 작은 따옴표(')와" + ' 큰 따옴표(")를 모두 쓰기도 해'
quote2 = """가끔은 작음 따옴표(')와 큰 따옴표(")를 모두 쓰기도 해"""

print(quote1)
print(quote2)

# error = "'"이렇게는 사용할 수 없다"'"